In [2]:
import pandas as pd

In [3]:
data=pd.read_csv("per_capita_income.csv")

# a.	Sort it in the descending order of the income

In [4]:
data.sort_values(by='Income per Capita',ascending=False).head()

               Country  Income per Capita
133              Qatar       141542.66280
97    Macao SAR, China       111496.62940
96          Luxembourg       102051.68030
144          Singapore        85382.30227
23   Brunei Darussalam        78369.29102

# b.	Display the first five rows and last five rows.

In [5]:
data.head()

               Country  Income per Capita
0          Afghanistan        1925.165228
1              Albania       11479.087460
2              Algeria       14688.203300
3               Angola        7386.700843
4  Antigua and Barbuda       23062.278270

In [6]:
data[::-1].head()

                Country  Income per Capita
183            Zimbabwe        1786.583862
182              Zambia        3835.503778
181         Yemen, Rep.        2820.801870
180  West Bank and Gaza        5020.119619
179             Vietnam        6034.259949

# Mean of Income per Capita

In [9]:
 def men():
        b=data['Income per Capita'].mean()
        return b
men()

19469.419565736953

 # Median of income of capita

In [11]:
 def med():
    a=data['Income per Capita'].median()
    return a
med()

11620.932519999998

# e.	Using broadcasting, create a new column 'Income per Capita (,000)'equal to income['Income per Capita'] // 1000. Then use the appropriate function to calculate the mode for this new column.

In [12]:
a=data['Income per Capita']/1000

In [13]:
data['Income per Capita1']=a

In [14]:
data.head()

               Country  Income per Capita  Income per Capita1
0          Afghanistan        1925.165228            1.925165
1              Albania       11479.087460           11.479087
2              Algeria       14688.203300           14.688203
3               Angola        7386.700843            7.386701
4  Antigua and Barbuda       23062.278270           23.062278

In [15]:
data['Income per Capita1'].mode()

0        0.618753
1        0.727151
2        0.784365
3        0.835367
4        0.955483
5        1.183605
6        1.192175
7        1.208986
8        1.455804
9        1.460345
10       1.465345
11       1.483441
12       1.569319
13       1.628923
14       1.679684
15       1.696026
16       1.757436
17       1.762314
18       1.786584
19       1.850992
20       1.853799
21       1.925165
22       1.994768
23       2.028158
24       2.056701
25       2.175822
26       2.200934
27       2.399014
28       2.420795
29       2.462075
          ...
154     37.575931
155     39.971093
156     40.718830
157     40.763404
158     41.016652
159     41.801049
160     42.309389
161     44.261838
162     45.757458
163     46.270799
164     46.586069
165     47.717237
166     47.861965
167     48.041701
168     49.020395
169     49.429556
170     49.587005
171     53.538790
172     56.115718
173     56.923491
174     62.083863
175     62.557491
176     68.513974
177     69.970815
178     74.645482
179     78.369291
180     85.382302
181    102.051680
182    111.496629
183    141.542663
Length: 184, dtype: float64